In [71]:
import pandas as pd
import numpy as np

In [72]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [73]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [74]:
df1 = df['FlightNumber'].interpolate()

In [75]:
df1.astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [76]:
temp = pd.DataFrame()
temp['From'] = df['From_To'].str.split('_').str[0]
temp

       From
0    LoNDon
1    MAdrid
2    londON
3  Budapest
4  Brussels

In [77]:
temp['To'] = df['From_To'].str.split('_').str[1]
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [78]:
temp['From'] = temp['From'].str.capitalize()

In [79]:
temp['From']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [80]:
temp['To'] = temp['To'].str.capitalize()

In [81]:
temp['To']

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [82]:
df.columns[[0,3]]

Index(['From_To', 'Airline'], dtype='object')

In [83]:
df.drop('From_To',axis=1,inplace=True)

In [84]:
df =pd.concat([df,temp[['From','To']]],axis=1)

In [85]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [86]:
df1 = df['RecentDelays'].values.tolist()
delay = pd.DataFrame(df1)
delay.columns = ['delayed','delayed_1','delayed_2']
df1 = pd.concat([df,delay[['delayed','delayed_1','delayed_2']]],axis=1)
df1

,FlightNumber,RecentDelays,Airline,From,To,delayed,delayed_1,delayed_2
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,NaN,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,NaN,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [87]:
df1.drop(columns='RecentDelays',axis=1, inplace=True)

In [88]:
df1

,FlightNumber,Airline,From,To,delayed,delayed_1,delayed_2
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,NaN,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,NaN,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN